# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки
print('test 1')
names = ['Оля', 'Петя', 'Вася', 'Маша']
# ???
for name in names:
    print(name)

# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём
# Пример вывода:
# Оля: 3
# Петя: 4
print('test 2')
names = ['Оля', 'Петя', 'Вася', 'Маша']
# ???
for name in names:
    print(f'{name}: {len(name)}')

# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика
print('test 3')
is_male = {
    'Оля': False,  # если False, то пол женский
    'Петя': True,  # если True, то пол мужской
    'Вася': True,
    'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша']
# ???
for name in names:
    if is_male[name]:
        gender = 'мальчик'
    else:
        gender = 'девочка'
    print(f'{name} - {gender}')

# Альтернативный вариант 1


gender = {True: 'мальчик', False: 'девочка'}
for name in names:
    print(f'{name}: {gender[is_male[name]]}')

# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# Группа 1: 2 ученика.
# Группа 2: 4 ученика.
print('test 4')
groups = [
    ['Вася', 'Маша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
    ['Оля', 'Петя', 'Гриша'],
]
# ???
i = 1
for group in groups:
    print(f'Группа {i}: {len(group)} ученика.')
    i += 1

# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят
# Пример вывода:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша
print('test 5')
groups = [
    ['Вася', 'Маша'],
    ['Оля', 'Петя', 'Гриша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
]
# ???
i = 1
for group in groups:
    print(f'Группа {i}: {" ".join(group)}')
    i += 1
